[{"id":"0","hadith":"عن أبي هريرة أن رسول الله صلى الله عليه وسلم كان يقول: الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات ما بينهن إذا اجتنب الكبائر رواه مسلم"},
  {"id":"1","hadith":"عن أبي هريرة أن رسول الله صلى الله عليه وسلم قال : من قام رمضان إيمانا واحتسابا غفر له ما تقدم من ذنبه رواه مسلم"},
  {"id":"2","hadith":"عن ابن أبي أنس أن أباه حدثه أنه سمع أبا هريرة يقول قال رسول الله : إذا كان رمضان فتحت أبواب الرحمة وغلقت أبواب جهنم وسلسلت الشياطين رواه مسلم"},
  {"id":"3","hadith":"عن علي بن أبي طالب : أن رسول الله كان يقول في آخر وتره :اللهم إني أعوذ برضاك من سخطك وبمعافاتك من عقوبتك وأعوذ بك منك لا أحصي ثناء عليك أنت كما أثنيت على نفسك"},
  {"id":"4","hadith":"ما رجع النبي صلى الله عليه وسلم من حجته ، قال لأم سنان الأنصارية : ما منعك من الحج . قالت : أبو فلان ، تعني زوجها ، كان له ناضحان حج على أحدهما ، والآخر يسقي أرضا لنا . قال : فإن عمرة في رمضان تقضي حجة معي اخرجه البخاري"},
  {"id":"5","hadith":"قال رسول الله صلى الله عليه وسلم بني الإسلام على خمس : شهادة أن لا إله إلا الله وأن محمدا رسول الله ، وإقام الصلاة ، وإيتاء الزكاة ، والحج ، وصوم رمضان.اخرجه البخاري"},
  {"id":"6","hadith":"عن سهل -رضي الله عنه-عن النبي -صلى الله عليه وسلم- قال: إن في الجنة بابا يقال له: الريان، يدخل منه الصائمون يوم القيامة لا يدخل منه أحد غيرهم. يقال: أين الصائمون؟ فيقومون لا يدخل منه أحد غيرهم، فإذا دخلوا أغلق فلم يدخل منه أحد"},
  {"id":"7","hadith":" عن أبي هريرة : قال قال رسول الله إذا كان أول ليلة من شهر رمضان صفدت الشياطين ومردة الجن وغلقت أبواب النار فلم يفتح منها باب وفتحت أبواب الجنة فلم يغلق منها باب وينادي مناد يا باغي الخير أقبل ويا باغي الشر أقصر ولله عتقاء من النار وذلك كل ليلة اخرجه الترمذي"},
  {"id":"8","hadith":"قال رسول الله -صلى الله عليه وسلم-: من لم يدع قول الزور والعمل به فليس لله حاجة في أن يدع طعامه وشرابه"},
  {"id":"9","hadith":"قال رسول الله -صلى الله عليه وسلم-: ما من عبد يصوم يوما في سبيل الله إلا باعد الله بذلك اليوم وجهه عن النار سبعين خريفا رواه مسلم"},
  {"id":"10","hadith":"عن أبي هريرة -رضي الله عنه- رواية قال: إذا أصبح أحدكم يوما صائما فلا يرفث ولا يجهل، فإن امرؤ شاتمه أو قاتله فليقل: إني صائم، إني صائم رواه مسلم"},
  {"id":"11","hadith":"عن أنس بن مالك رضي الله عنه قال: قال النبي صلى الله عليه وسلم: تسحَّروا فإن في السحور بركة أخرجه البخاري ومسلم"},
  {"id":"12","hadith":"عن حفصة رضي الله عنها، عن النبي صلى الله عليه وسلم قال: من لم يبيِّت الصيامَ قبل الفجر فلا صيام له رواه أحمد"},
  {"id":"13","hadith":"عن أبي هريرة -رضي الله عنه- رواية قال: إذا أصبح أحدكم يوما صائما فلا يرفث ولا يجهل، فإن امرؤ شاتمه أو قاتله فليقل: إني صائم، إني صائم رواه مسلم"},
  {"id":"14","hadith":"عن أنس عن زيد بن ثابت رضي الله عنه قال: تسحَّرنا مع النبي صلى الله عليه وسلم ثم قام إلى الصلاة، قلت: كم كان بين الأذان والسحور؟ قال: قدر خمسين آية. متفق عليه أخرجه البخاري ومسلم"},
  {"id":"15","hadith":"عن أنس بن مالك رضي الله عنه قال: كان النبي صلى الله عليه وسلم يفطر قبل أن يصلي على رُطَبات، فإن لم تكن رُطَبات فتُميرات، فإن لم تكن تميرات حسا حسوات من ماء .رواه أحمد وأبو داود"},
  {"id":"16","hadith":"عن ابن أبي أنس أن أباه حدثه أنه سمع أبا هريرة يقول قال رسول الله : إذا كان رمضان فتحت أبواب الرحمة وغلقت أبواب جهنم وسلسلت الشياطين رواه مسلم"},
  {"id":"17","hadith":"عن عائشة رضي الله عنها قالت: قلت يا رسول الله، أرأيتَ إن علمتُ أي ليلةٍ ليلةُ القدر ما أقول فيها؟ قال: قولي اللهم إنك عفو كريم، تحب العفو، فاعف عني رواه أحمد"},
  {"id":"18","hadith":"عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من نسي وهو صائم فأكل أو شرب فليتمَّ صومه؛ فإنما أطعمه الله وسقاه أخرجه البخاري ومسلم"},
  {"id":"19","hadith":"عن عائشة رضي الله عنها قالت: كان النبي صلى الله عليه وسلم إذا دخل العشر شدَّ مئزره وأحيا ليله، وأيقظ أهله. أخرجه البخاري"},
  {"id":"20","hadith":"عن عائشة رضي الله عنها قالت: كان رسول الله صلى الله عليه وسلم يجتهد في العشر الأواخر ما لا يجتهد في غيره. أخرجه مسلم"},
  {"id":"21","hadith":"عن عبد الله بن عمرو أن رسول الله صلى الله عليه وسلم قال: الصيام والقرآن يشفعان للعبد يوم القيامة، يقول الصيام: أي رب، منعته الطعام والشهوات بالنهار فشفِّعني فيه، ويقول القرآن: منعته النوم بالليل فشفعني فيه، قال: فيُشفَّعان رواه أحمد"},
  {"id":"22","hadith":"عن زيد بن خالد الجهني رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: من فطَّر صائما كان له مثلُ أجرِه غيرَ أنه لا ينقص من أجر الصائم شيئا رواه أحمد"},
  {"id":"23","hadith":"عن سهل بن سعد رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: ((لا يزال الناس بخير ما عجَّلوا الفطر))أخرجه البخاري"},
  {"id":"24","hadith":"عن أبي هريرة رضي الله عنه أن النبي صلى الله عليه وسلم قال: من ذَرَعه القيء فليس عليه قضاء، ومن استقاء عمدًا فليقض أخرجه أحمد وأبو داود"},
  {"id":"25","hadith":"عن لقيط بن صبرة رضي الله عنه قال: قلت: يا رسول الله، أخبرني عن الوضوء، قال: أسبغ الوضوء، وخلِّل بين الأصابع، وبالغ في الاستنشاق إلا أن تكون صائما رواه أحمد"},
  {"id":"26","hadith":"عن حمزة بن عمرو الأسلمي رضي الله عنه أنه قال: يا رسول الله، أجد بي قوةً على الصيام في السفر، فهل عليَّ جناح؟ فقال رسول الله صلى الله عليه وسلم: هي رخصة من الله، فمن أخذ بها فحسن، ومن أحبَّ أن يصوم فلا جناح عليه أخرجه البخاري ومسلم"},
  {"id":"27","hadith":"عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم قال: من مات وعليه صيام صام عنه وليه أخرجه البخاري ومسلم"},
  {"id":"28","hadith":"عن ابن عباس رضي الله عنهما أن النبي صلى الله عليه وسلم احتجم وهو محرم، واحتجم وهو صائم. أخرجه البخاري ومسلم"},
  {"id":"29","hadith":"عن عائشة رضي الله عنها أن رسول الله صلى الله عليه وسلم قال: تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان أخرجه البخاري ومسلم"},
  {"id":"30","hadith":"عن عائشة رضي الله عنها قالت: قلت: يا رسول الله، أرأيتَ إن علمتُ أي ليلةٍ ليلةُ القدر ما أقول فيها؟ قال: قولي: اللهم إنك عفو كريم، تحب العفو، فاعف عني رواه أحمد والترمذي"},
  {"id":"31","hadith":"عن عائشة رضي الله عنها قالت : كان رسول الله صلى الله عليه وسلم يصوم حتى نقول لا يفطر ، ويفطر حتى نقول لا يصوم ، فما رأيت رسول الله صلى الله عليه وسلم استكمل صيام شهر إلا رمضان ، وما رأيته أكثر صياما منه في شعبان .اخرجه البخاري"}]